{
  "Yakima": {
    "river": "Yakima",
    "summary": "The Yakima River is currently in great shape for fishing. The river flow is stable at 2,650 cfs at Umtanum with a slight rise due to recent rain. Water clarity is good at 24\"+ Vis Green and the water temperature ranges between 42-45 F. \n\nThe Skwala Dry Flies are active during the afternoon hours while Skwala Nymphs dominate the morning. Worms, Mayfly Nymphs, Stonefly Nymphs, Sculpin and Various Streamers, and Olive Streamers are also working well. Besides, Caddis Larvae and March Browns have begun to show up consistently in the upper Lower Canyon and Farmlands sections. \n\nThe fishing condition is likely to improve once the water level drops. Nymphing earlier in the day and switching to dry flies as the day progresses is recommended for effective fishing. Anglers should look out for upcoming March Browns and Baetis hatches. \n\nIn terms of access, wade fishing has been solid throughout the system, especially in the Lower Canyon. The weather is slowly warming up with spring, and the fishing outlook for the coming weeks looks promising. However, remember that trout are currently in the mid to late stages of spawn, so handle with care to maintain their health.",
    "sources": [
      {
        "source": "Red's Fly Fishing",
        "title": "Yakima River Fishing Report — Red's Fly Shop",
        "url": "https://redsflyfishing.com/blogs/yakima-river-fishing-report/yakima-river-report",
        "lastUpdated": "2025-04-09"
      },
      {
        "source": "Evening Hatch",
        "title": "North Washington guide service",
        "url": "https://theeveninghatch.com/reports",
        "lastUpdated": "2025-04-09"
      },
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 4/2/2025",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      },
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 11/14/2024",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      }
    ],
    "lastUpdated": "2025-04-09"
  },
  "Snoqualmie": {
    "river": "Snoqualmie",
    "summary": "The Snoqualmie River downstream is currently closed for fishing until later in April, although the upper forks are open and can provide decent trout fishing at this time of year (Avid Angler - 4/2/2025). Snow melt can significantly impact water levels and fishing conditions, so it's crucial to keep an eye on that (Avid Angler - 4/2/2025). There might be a few fish around interested in dry flies, but the majority of catches are likely to be on nymph patterns or small streamers (Avid Angler - 4/2/2025). \n\nIn the lower Snoqualmie, winter steelhead could be a good bet if water clarity is favorable (Avid Angler - 1/2/2025). The middle fork, specifically above the falls, continues to be a hot spot for local trout (Avid Angler - 1/2/2025). Nymph fishing is the go-to technique for this time of year, but swinging a streamer through your favorite run could yield surprising results (Avid Angler - 1/2/2025). \n\nOverall, the outlook is promising for the weeks ahead, pending water clarity and flow conditions. Always remember to check the latest regulations and restrictions before heading out.",
    "sources": [
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 4/2/2025",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      },
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 1/2/2025",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      }
    ],
    "lastUpdated": "2025-04-09"
  },
  "Skagit": {
    "river": "Skagit",
    "summary": "The Skagit River is still open for steelhead fishing for almost two more weeks, and recent conditions have been promising (source: Avid Angler, 4/2/2025). Rain and snow melt have brought more fish into the river, with some successful catches reported. As the season progresses, the fish begin to adopt a more freshwater taste, prompting a shift in fly color choice towards more natural and muted shades. The rivers can get crowded during this time, so patience is advised (source: Avid Angler, 2/26/2025). The run has been strong this season, with some impressive catches documented. Respect for the fish is emphasized, with a focus on ensuring they are returned safely to the water. Looking ahead, conditions are expected to remain favorable until the close of the season, providing ample opportunities for both seasoned and novice anglers.",
    "sources": [
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 4/2/2025",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      },
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 2/26/2025",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      }
    ],
    "lastUpdated": "2025-04-09"
  },
  "Skykomish": {
    "river": "Skykomish",
    "summary": "The Skykomish River is currently closed for fishing as of 4/2/2025 (Avid Angler). However, earlier this year, fishing for steelhead was encouraged before the majority of the river closed at the end of January. A small stretch near the Reiter Ponds Hatchery remained open until mid-February, which was a great time to target steelhead. There were reports of some fish being caught during this period (Avid Angler, 1/22/2025). \n\nDuring the open season, the use of a Spey rod proved beneficial for casting sink tips and larger flies with little to no back cast room, which is a common feature of the Skykomish's steelhead waters. For those using a single-handed rod, big gravel bars up and down the river provided some backcast room. A variety of sink tips were recommended to get flies down in the zone, as winter steelhead don't like to chase a fly as much as their summer counterparts. The Avid Angler team was willing to assist with spey casting or getting into the sport. \n\nThe outlook for the upcoming weeks is unclear due to the current closure of the river. Future updates will provide information on river reopening and conditions.",
    "sources": [
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 4/2/2025",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      },
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 1/22/2025",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      }
    ],
    "lastUpdated": "2025-04-09"
  },
  "Stillaguamish": {
    "river": "Stillaguamish",
    "summary": "The Stillaguamish River is currently closed for fishing as per the latest update from Avid Angler (4/2/2025). Prior to the closure, the river was providing decent opportunities for steelhead, even though no standout reports were received (Avid Angler - 1/22/2025). The river was mostly accessible and open for fishing through the end of January and partially open until mid-February. Anglers were advised to actively seek out fish, as their presence in the river was expected throughout the open season. Unfortunately, specific details regarding flow/clarity, hatch and bug activity, and effective fly patterns or setups were not mentioned in the reports. As we await the reopening of the river, it's advisable to frequently check for updates on fishing conditions.",
    "sources": [
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 4/2/2025",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      },
      {
        "source": "Avid Angler",
        "title": "Avid Angler - 1/22/2025",
        "url": "https://avidangler.com/fishing-reports",
        "lastUpdated": "2025-04-09"
      }
    ],
    "lastUpdated": "2025-04-09"
  }
}